/******************************************************************************
* 文件名         : hw_common.c
* 工程名         : *
* 作者           : pengwei
* 版本           : *
* 日期           : *
* 描述           : 通用程序
*
*******************************************************************************/

#include "hw_lib.h"



void delay_100us(u32 count)
{
		u32 i,j;
		
		for(j=0; j<count; j++)
		{
			 for(i=0;i<660;i++);
		}
}

void delay_us(u32 count)
{
		u32 i;
		
		for(i=0; i<count; i++)
		{
			 ;
		}
}

//void delay_ms(u32 count)//48Mhz,0.5ms
//{
//	u16 i,j;
//		for(i=0;i<count;i++)
//			for(j=0;j<2500;j++);
//}



/*******************************************END OF FILE******************************************/








